In [3]:
import numpy as np
import pandas as pd

# 1 Creating a Dataframe from an array

## 1.1 Option 1

In [4]:
# Creating an array
data = np.array([[1,4], [2,5], [3,6]])

In [5]:
# Creating a dataframe
df = pd.DataFrame(data, index = ['row 1', 'row 2', 'row 3'], columns = ['col 1','col 2'])

In [6]:
# Showing the dataframe
df

       col 1  col 2
row 1      1      4
row 2      2      5
row 3      3      6

## 1.2 Option 2

In [7]:
# Creating an array with listshape
data = [[1,4], [2,5], [3,6]]

In [8]:
# Creating a dataframe
df = pd.DataFrame(data, index = ['row 1', 'row 2', 'row 3'], columns = ['col 1','col 2'])

In [9]:
# Showing the dataframe
df

       col 1  col 2
row 1      1      4
row 2      2      5
row 3      3      6

# 2 Creating a Dataframe from a dictionary

In [10]:
# lists used for this example
states = ['California', 'Texas', 'Florida', 'New york']
population = [39613493, 29730311, 21944577, 19299981]

In [11]:
# Storing lists within a dictionary
dict_states = {'States':states, 'Population':population}

In [12]:
# Creating the dataframe
df_population = pd.DataFrame(dict_states)

In [14]:
# Showing the dataframe
df_population

       States  Population
0  California    39613493
1       Texas    29730311
2     Florida    21944577
3    New york    19299981

# 3 Creating a DataFrame from a csv file

In [24]:
# when we read data from a csv file, the csv file is usually called a dataset and the result after reading a data set
# using pandas is called a data frame

In [17]:
# reading the csv file
df_exams = pd.read_csv('StudentsPerformance.csv')

In [20]:
# Show first 5 rows in a dataframe
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86